Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: These are documented in L<perlvar>.
es: Se describen en L<perlvar>.

source: These are known as "barewords".
es: En Perl, estas palabras se denominan "I<barewords>" (palabras sueltas).

source: These are methods that can get or set the value of each attribute.
es: Estos son métodos que permiten obtener o establecer el valor de cada atributo.

source: These are not the very basics, though.
es: Aunque estos conceptos no son tan básicos...

source: These are run first in the test suite and if any of them fail, something is I<really> broken.
es: Son las primeras que se ejecutan del conjunto de pruebas; si no se supera alguna de estas pruebas, significa que hay un problema grave.

source: These are scripts which will check the source things like ANSI C violations, POD encoding issues, etc.
es: Scripts que detectarán en el código fuente cosas como infracciones de ANSI C, problemas de codificación de POD, etc.

source: These are the C<BEGIN>, C<UNITCHECK>, C<CHECK>, C<INIT>, and C<END> blocks.
es: Son los bloques C<BEGIN>, C<UNITCHECK>, C<CHECK>, C<INIT> y C<END>.

source: These are two types of accessors.
es: Son dos tipos de métodos de acceso.

source: These code blocks can be prefixed with C<sub> to give the appearance of a subroutine (although this is not considered good style).
es: Estos bloques de código pueden usarse con el prefijo C<sub> para dar la apariencia de ser subrutinas (aunque esto no se recomienda).

source: These conversions are governed by the following general rules:
es: Estas conversiones obedecen las siguientes normas generales:

source: These examples often reflect the style and preference of the author of that piece of the documentation, and may be briefer than a corresponding line of code in a real program.
es: Los ejemplos de las distintas partes de la documentación reflejan el estilo y las preferencias de sus autores, y pueden ser más escuetos que una línea de código equivalente en un programa real.

source: These features are no longer considered experimental and their functionality has disappeared.
es: Estas funcionalidades ya no se consideran experimentales y se han suprimido.

source: These features were so wildly successful and played so well with others that we decided to remove their experimental status and admit them as full, stable features in the world of Perl, lavishing all the benefits and luxuries thereof.
es: Estas funcionalidades han tenido tanto éxito e interactúan tan bien con otros componentes que hemos decido dejar de considerarlas experimentales y aprobarlas como funcionalidades completas y estables en Perl, con todas las ventajas y regalías que eso conlleva.

source: These files contain information on who maintains which modules.
es: En estos archivos se indica quién mantiene cada módulo.

source: These flag bits are part of the L</mode> word returned by the L<stat|perlfunc/stat> built-in when you ask about a file.
es: Estos bits de marca forman parte de la palabra de L</modo> devuelta por la función predefinida L<stat|perlfunc/stat> cuando se pregunta sobre un archivo.

source: These have been designed so that in general you don't have to worry about it, but this section gives the gory details.
es: Estas interacciones se han diseñado de forma que, en general, no tenga que preocuparse por ello, pero en esta sección se explican los detalles más complejos.

source: These hosts have fairly strict firewalls to the outside.
es: El acceso de estos hosts al exterior está considerablemente restringido mediante firewall.

source: These languages are characterized by representing everything as a non-architecture-dependent sequence of bytes.
es: Estos lenguajes se caracterizan porque representan todo como una secuencia de bytes independiente de la arquitectura.

source: These languages have their own newsgroups in which you can learn about (but hopefully not argue about) them.
es: Estos lenguajes tienen sus propios grupos de noticias, en los que puede obtener más información sobre ellos (preferiblemente sin herir sensibilidades).

source: These last until their block is exited, but may be passed back.
es: Durará hasta que se salga del bloque, pero se puede volver a pasar.

source: These look like
es: La sintaxis es

source: These modifiers are restored at the end of the enclosing group.
es: Estos modificadores se restauran al final del grupo que los contiene.

source: These modifiers do not carry over into named subpatterns called in the enclosing group.
es: Estos modificadores no se transfieren a subpatrones con nombre del grupo que los contiene.

source: These modifiers, all new in 5.14, affect which character-set semantics (Unicode, etc.) are used, as described below in L</Character set modifiers>.
es: Estos modificadores, incorporados en la versión 5.14, afectan a la semántica de juego de caracteres (Unicode, etc.) usada, como se explica más abajo, en L</Modificadores de juego de caracteres>.

source: These modules have the advantage of not hiding different types of the same name during the local().
es: Estos módulos tienen la ventaja de no ocultar diferentes tipos del mismo nombre mientras local() esté activo.

source: These modules generally have their F<Makefile.PL> and are laid out more like a typical CPAN module.
es: Estos módulos suelen tener un archivo F<Makefile.PL> y su estructura es similar a la del típico módulo de CPAN.

source: These should give you an overall feel for how modules are laid out and written.
es: Estos módulos le proporcionarán una idea general de cómo se estructura y desarrolla un módulo.

source: These special patterns are generally of the form C<(*VERB:ARG)>.
es: Estos patrones especiales son, generalmente, de la forma C<(*VERBO:ARG)>.

source: These special variables are used for all kinds of purposes, and are documented in L<perlvar>.
es: Estas variables especiales se usan para diversos fines y se describen en L<perlvar>.

source: These special variables, like the C<%+> hash and the numbered match variables (C, C, C, etc.) are dynamically scoped until the end of the enclosing block or until the next successful match, whichever comes first.
es: Estas variables especiales, como el hash C<%+> y las variables de coincidencia numeradas (C, C, C, etc.) tienen ámbito dinámico hasta el final del bloque actual o hasta la siguiente coincidencia, lo que ocurra primero.

source: These strengths make it especially popular with system administrators and CGI script authors, but mathematicians, geneticists, journalists, and even managers also use Perl.
es: Por estas cualidades es muy popular entre los administradores de sistemas y los programadores de scripts CGI, pero también lo usan matemáticos, expertos en ingeniería genética, periodistas e incluso directivos.

source: These threads can be used by using the C<threads> module or by doing fork() on win32 (fake fork() support).
es: Estos hilos de ejecución pueden usarse con el módulo C<threads> o bien ejecutando fork() en win32 (en realidad, una simulación de fork()).

source: These threads can be used explicitly and implicitly.
es: Estos hilos de ejecución se pueden usar de forma explícita e implícita.

source: These two boxes are owned, hosted, and operated by booking.com.
es: Estos dos equipos son propiedad de booking.com, que se encarga de su alojamiento y administración.

source: These two terms are synonymous: a L<captured substring|/capturing> by a regex subpattern.
es: Estos dos términos son sinónimos: es una L<subcadena capturada|/capturar> por un subpatrón de expresión regular.

source: These utilities help manage extra Perl modules that don't come with the perl distribution.
es: Estas utilidades ayudan a administrar módulos Perl adicionales que no se incluyen en la distribución de perl.

source: These values are passed to a Perl program through C<@ARGV>.
es: Estos valores se pasan a un programa Perl a través de C<@ARGV>.

source: They I<are> reserved with respect to labels and filehandles, however, which don't have an initial special character.
es: Sin embargo, I<sí están reservadas> con respecto a las etiquetas y los identificadores de archivo, ya que los nombres de estos no requieren usar un carácter especial inicial.

source: They are also awarded +5 Stability and +3 Charisma.
es: También les hemos concedido 5 puntos por Estabilidad y 3 por Carisma.

source: They are not local to a scope, nor readonly, but instead are volatile package variables similar to C<$AUTOLOAD>.
es: No son locales en un ámbito, ni de solo lectura; son variables de paquete volátiles, similares a C<$AUTOLOAD>.

source: They are only required occasionally to clarify issues of precedence.
es: Solo son necesarios en algunos casos para aclarar la precedencia.

source: They are subject to removal and/or bug-incompatible reimplementation in the next major release (but they will be preserved through maintenance releases).
es: Pueden ser eliminados o reimplementados eliminando los defectos en la siguiente versión principal (pero se conservarán en las versiones de mantenimiento).

source: They are: Benjamin Smith, Jan-Pieter Cornet, Johan Vromans, Lukas Mai, Nathan Gray.
es: Benjamin Smith, Jan-Pieter Cornet, Johan Vromans, Lukas Mai, Nathan Gray.

source: They can also have C<Content-Length> to indicate the number of I<bytes>, which is always a good idea to supply if the number is known.
es: También se puede utilizar C<Content-Length> para indicar el número de I<bytes>, un dato que siempre viene bien conocer.

source: They can be used to capture the results of parts of the regexp match for later use.
es: se pueden usar para capturar los resultados de partes de una expresión regular a fin de usarlos posteriormente.

source: They can be created and executed during any phase.
es: Se pueden crear y ejecutar en cualquier fase.

source: They check different things so you need both.
es: Comprueban cosas distintas, por lo que ambas deben ser incluidas.

source: They don't check that a C<$path> is defined, nor do they check that a C<$path> is a valid filesystem path.
es: No comprueban si la C<$ruta> está definida, ni si se trata de una ruta del sistema de archivos válida.

source: They exist for Perl's internal use, so that complex regular expression data structures can be automatically serialized and later exactly reconstituted, including all their nuances.
es: Son para uso interno de Perl, para que las estructuras de datos complejas de las expresiones regulares se puedan serializar automáticamente y reconstituirse posteriormente de forma precisa, con todos sus matices.

source: They have strange names so they don't accidentally collide with one of your normal variables.
es: Estas variables tienen nombres extraños para evitar conflictos accidentales con las variables normales.

source: They may be used only as separate tokens; they will not be interpolated into strings.
es: Solo se pueden utilizar como símbolos aislados; no se interpolan dentro de cadenas.

source: They produce the standard C<Makefile.PL> you see when you download and install modules, and this produces a Makefile with a C<dist> target.
es: Crea el archivo C<Makefile.PL> estándar que se usa para instalar los módulos descargados, y que produce un archivo Makefile con un destino C<dist>.

source: They take only one byte per character.
es: Ocupan un solo byte por carácter.

source: They thus revert to their pre-5.6, pre-Unicode meanings.
es: De este modo, recuperan sus significados anteriores a la versión 5.6 y a Unicode.

source: They were v-strings from Perl 5.6.0 to Perl 5.8.0, but that caused more confusion and breakage than good.
es: Fueron v-strings desde Perl 5.6.0 a Perl 5.8.0, pero su uso causaba confusión y problemas.

source: They work much like quotes in the standard Unix shells: double-quoted string literals are subject to backslash and variable substitution; single-quoted strings are not (except for C<\'> and C<\\>).
es: Estas comillas funcionan de forma muy parecida a las comillas en las shell estándar de Unix: los literales de cadena entre comillas dobles están sujetos al uso de la barra diagonal inversa y la sustitución de variables; en cambio, las cadenas entre comillas simples no lo están (a excepción de C<\'> y C<\\>).

source: They're also supported as operators in their own right.
es: Son también operadores.

source: They're called "closures" because this sort of behavior gives mathematicians a sense of closure.
es: Se llaman "clausuras" porque este tipo de comportamiento proporciona a los matemáticos una sensación de clausura, o cierre.

source: They're discussed in Part 3 of this FAQ, along with CPAN, which is discussed in Part 2.
es: Se describen en la parte 3 de este conjunto de documentos sobre preguntas más frecuentes. CPAN se describe en la parte 2.

source: They're more readable than the C-style operators, but have different precedence to C<&&> and friends.
es: Ofrecen más legibilidad que los operadores tipo C correspondientes, como C<&&>, pero su precedencia es distinta.

source: Things have degenerated to the point that Perl's L<index|perlfunc/index> function merely locates the position (index) of one string in another.
es: Las cosas han degenerado hasta el punto de que la función L<index|perlfunc/index> de Perl simplemente localiza la posición (el índice) de una cadena en otra.

source: Things that make Perl easier to learn: Unix experience, almost any kind of programming experience, an understanding of regular expressions, and the ability to understand other people's code.
es: Si tiene experiencia en el uso de Unix, cualquier tipo de experiencia en programación, conocimientos de expresiones regulares y la capacidad de leer y entender el código de otros programadores, le costará menos aprender Perl.

source: Think about reusability.
es: Piense en la reutilización.

source: Think long and hard about whether you want to push a local tag to perl.git before doing so.
es: Si desea enviar una etiqueta local a perl.git, piénselo detenidamente antes de hacerlo.

source: This construct is useful for optimizations of what would otherwise be "eternal" matches, because it will not backtrack (see L<"Backtracking">).
es: Esta construcción es útil para la optimización de lo que de otro modo serían comparaciones "eternas", puesto que no hay vuelta atrás (vea L<"Vuelta atrás">).

source: This exponential performance will make it appear that your program has hung.
es: Esta degradación exponencial del rendimiento le hará creer que su programa se ha bloqueado.

source: This feature can be extremely useful to give perl hints about where it shouldn't backtrack.
es: Esta característica puede ser muy útil para dar pistas a perl sobre dónde no se debe dar marcha atrás.

source: This is a somewhat tricky way of passing around references cheaply when you don't want to have to remember to dereference variables explicitly.
es: Esta es una forma poco habitual de pasar referencias de forma sencilla, cuando no se desea tener que recordar cómo desreferenciar variables de forma explícita.

source: This is not for the faint of heart, as they have to plug in at the C level.
es: Esto no es para quienes buscan la tranquilidad, ya que requiere usar C.

source: This largely eliminates the need for typeglobs when opening filehandles that must be passed around, as in the following example:
es: Esto elimina en gran medida la necesidad de usar typeglobs al abrir identificadores de archivo que hay que pasar de un lugar a otro, como en el ejemplo siguiente:

source: This mark may be given a name.
es: A esta marca se le puede asignar un nombre.

source: This method is called automatically by the C<VERSION> form of C<use>.
es: La forma C<VERSION> de C<use> llama a este método automáticamente.

source: This method might produce different output for each class, but they share a common interface.
es: Este método puede producir salidas diferentes para cada clase, pero la interfaz es común.

source: This might be more (or less) convenient, depending on what shell you use.
es: Esto puede resultar más (o menos) cómodo según la shell que se use.

source: This parent is really a rather ridiculous creation.
es: De hecho, esta clase primaria es más bien ridícula.

source: This sometimes (but very rarely) has false positives and you might get blocked.
es: A veces (aunque raramente) esto produce falsos positivos y en ese caso se le bloqueará.

source: This 'cheat sheet' is a handy reference, meant for beginning Perl programmers.
es: Esta 'hoja resumen' es una referencia útil para programadores principiantes.

source: This allows one to define subpatterns which will be executed only by the recursion mechanism.
es: Esto permite definir subpatrones que solo serán ejecutados por el mecanismo de recursión.

source: This allows one to specify the I<language code> for the desired language translation.
es: Este modificador permite especificar el I<código de idioma> para obtener la traducción del documento en el idioma deseado.

source: This allows the constructs such as C<open(my $fh, ...)> and C<open(local $fh,...)> to be used to create filehandles that will conveniently be closed automatically when the scope ends, provided there are no other references to them.
es: Esto permite utilizar instrucciones como C<open(my $archivo, ...)> y C<open(local $archivo,...)> para crear identificadores de archivo que convenientemente se cerrarán automáticamente cuando termine el ámbito de aplicación, siempre que no haya otras referencias a ellos.

source: This allows you to interpolate regexes into larger regexes and not have to worry about the capture groups being renumbered.
es: Esto permite interpolar expresiones regulares en grandes expresiones regulares sin tener que preocuparse por el cambio en la numeración de los grupos de captura.

source: This allows you to update your local repository by pulling from C<origin>, which is faster and doesn't require you to authenticate, and to push your changes back with the C<camel> remote:
es: Esto permite actualizar el repositorio local trayendo los cambios desde C<origin>, lo cual es más rápido y no requiere autenticación, y volver a enviar los cambios con el servidor C<camel> remoto:

source: This also has implications for the use of the SUPER:: qualifier (see L<perlobj>).
es: Esto también tiene implicaciones para el uso del calificador SUPER:: (vea L<perlobj>).

source: This also helps to differentiate new modules from old F<.pl> and F<.ph> files.
es: Esto también ayuda a distinguir los módulos nuevos de los antiguos, que usaban la extensión F<.pl> o F<.ph>.

source: This also means that if you want real whitespace or C<#> characters in the pattern (outside a character class, where they are unaffected by C</x>), then you'll either have to escape them (using backslashes or C<\Q...\E>) or encode them using octal, hex, or C<\N{}> escapes.
es: Esto también significa que si desea usar espacio en blanco real o caracteres C<#> en el patrón (excepto en una clase de caracteres, donde no les afecta C</x>), tendrá que marcarlos con barras diagonales inversas de escape o C<\Q...\E>, o codificarlos en octal, hexadecimal o secuencias de escape C<\N{}>.

source: This always means your main memory, not your disk.
es: Siempre hace referencia a la memoria principal, no al disco.

source: This array is examined when Perl does method resolution, which we will cover later.
es: Perl examina este array cuando realiza la resolución de métodos, como se verá a continuación.

source: This assertion may be used as a C<(?(condition)yes-pattern|no-pattern)> switch.
es: Esta aserción se puede usar con un modificador C<(?(condición)patrón-sí|patrón-no)>.

source: This assignment:
es: La siguiente asignación:

source: This assumes that the overloaded operators will often have the same relationships as the regular operators.
es: Se supone que los operadores sobrecargados tendrán generalmente las mismas relaciones que los operadores normales.

source: This bit must be explicitly set by the owner to enable this feature, and the program must be carefully written not to give away more privileges than it ought to.
es: Este bit debe ser establecido explícitamente por el propietario y hay que tener cuidado para que el programa no otorgue más privilegios que los debidos.

source: This both implicitly adds the C</l> and applies locale rules to the C<\U>.
es: De manera implícita, esto agrega C</l> y aplica las reglas de configuración regional para C<\U>.

source: This can be done in a varierty of ways, including using L<"Inside-Out objects"> or modules from CPAN.
es: Esto puede hacerse de diversas formas; por ejemplo, mediante el uso de L<"Objetos I<Inside-Out>"> o con algunos módulos específicos de CPAN.

source: This can be done with either L<symbolic references|/symbolic reference> or L<hard references|/hard reference>.
es: Esto se puede hacer con L<referencias simbólicas|/referencia simbólica> o con L<referencias estrictas|/referencia estricta>.

source: This can be rather inefficient.
es: Esto puede ser muy ineficaz.

source: This can be used safely on any string, as it checks and does not change strings that have already been upgraded.
es: Esto se puede aplicar de manera segura a cualquier cadena, puesto que comprueba si una cadena ya se ha promovido y, en caso afirmativo, no la modifica.

source: This can be used to determine which branch of a pattern was matched without using a separate capture group for each branch, which in turn can result in a performance improvement, as perl cannot optimize C</(?:(x)|(y)|(z))/> as efficiently as something like C</(?:x(*MARK:x)|y(*MARK:y)|z(*MARK:z))/>.
es: Esto se puede usar para determinar la rama de un patrón que coincidió sin necesidad de utilizar un grupo de captura independiente para cada rama, lo que puede suponer una mejora de rendimiento, ya que Perl no puede optimizar C</(?:(x)|(y)|(z))/> de forma tan eficiente como algo parecido a C</(?:x(*MARK:x)|y(*MARK:y)|z(*MARK:z))/>.

source: This can be very useful for writing dynamic code.
es: Esto puede ser muy útil para escribir código dinámico.

source: This can make it seem like you have a little more memory than you really do, but it's not a substitute for real memory.
es: Esto puede hacer que parezca que se dispone de más memoria de la que realmente hay, pero no sustituye la memoria real.

source: This change will allow for future syntax extensions (like making the lower bound of a quantifier optional), and better error checking of quantifiers.
es: Este cambio permitirá futuras extensiones de la sintaxis (como hacer opcional el límite inferior de un cuantificador) y una mejor comprobación de errores de los cuantificadores.

source: This check is the regex equivalent of
es: Esta comprobación es el equivalente en expresiones regulares a

source: This checks for the method in the class and all of its parents.
es: Comprueba la existencia del método en la clase y en todas sus clases primarias.

source: This class provides a number of methods, all of which can be called on either a class or an object.
es: Esta clase proporciona un conjunto de métodos que se pueden llamar desde una clase o un objeto.

source: This code generation means that your runtime code is as fast as it can be, but you pay for this when your modules are first loaded.
es: Esto hace que el código en tiempo de ejecución sea lo más eficiente posible, pero tendrá un coste cuando todo este código se cargue por primera vez.
